[Killed] BooleanLiteral
main/components/Courses/SchoolDropdown.js:15:45
         <Form.Label htmlFor="school">School</Form.Label>
         <Form.Control data-testid={`${testId}-school`} id="school"  as="select"
           isInvalid={Boolean(errors.school)}
-          {...register("school", {required: true, minLength: 2})}
+          {...register("school", {required: false, minLength: 2})}
         >
             <option value=""></option>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /School is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BlockStatement
main/components/Courses/SchoolDropdown.js:18:47
           {...register("school", {required: true, minLength: 2})}
         >
             <option value=""></option>
-            {schools.map(function (object, i) {
-                const key = `${testId}-option-${i}`
-                return(
-                    <option key={key} data-testid={key} value={object.name}>
-                        {object.name}
-                    </option>
-                );
-            })}
+            {schools.map(function (object, i) {})}
         </Form.Control>
         <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests No Error messages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
