[Killed] LogicalOperator
src/main/pages/CoursesIndexPage.js:37:13
     return (
       <BasicLayout>
         <div className="pt-2">
-          {(hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) && createButton()}
+          {(hasRole(currentUser, "ROLE_ADMIN") && hasRole(currentUser, "ROLE_INSTRUCTOR")) && createButton()}
           <h1>Course</h1>
           <CoursesTable courses={courses} currentUser={currentUser} showEnabled={true} deleteEnabled={true} />
killedBy: CoursesIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Course/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BooleanLiteral
src/main/pages/CoursesIndexPage.js:39:103
         <div className="pt-2">
           {(hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) && createButton()}
           <h1>Course</h1>
-          <CoursesTable courses={courses} currentUser={currentUser} showEnabled={true} deleteEnabled={true} />
+          <CoursesTable courses={courses} currentUser={currentUser} showEnabled={true} deleteEnabled={false} />
     
         </div>
killedBy: CoursesIndexPage tests what happens when you click delete, admin
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BooleanLiteral
src/main/pages/CoursesIndexPage.js:39:82
         <div className="pt-2">
           {(hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) && createButton()}
           <h1>Course</h1>
-          <CoursesTable courses={courses} currentUser={currentUser} showEnabled={true} deleteEnabled={true} />
+          <CoursesTable courses={courses} currentUser={currentUser} showEnabled={false} deleteEnabled={true} />
     
         </div>
killedBy: CoursesIndexPage tests Show button appears for instructor
statusReason: Error: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-Show-button"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
