[Killed] ConditionalExpression
src/main/pages/CoursesShowPage.js:27:8
         );
     //this ensures the table row doesn't show up when there's no backend
     let passIn;
-    if(courses.length !== 0){
+    if(true){
         passIn = [courses]
     }else{
killedBy: CoursesShowPage tests renders empty table when backend unavailable, admin
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="CoursesTable-cell-row-0-col-id" role="cell" /> instead
