[Killed] ObjectLiteral
main/components/Students/StudentsTable.js:16:9
             Header: 'courseId',
             accessor: 'courseId',
         },
-        {
-            Header: 'fname',
-            accessor: 'fname',
-        },
+        {},
         {
            Header: 'lname',
killedBy: CoursesShowPage tests renders course correctly for admin
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Students/StudentsTable.js:17:21
             accessor: 'courseId',
         },
         {
-            Header: 'fname',
+            Header: "",
             accessor: 'fname',
         },
killedBy: StudentsTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: fname. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div>
      Total Students: 
      3
    </div>

[Killed] StringLiteral
main/components/Students/StudentsTable.js:18:23
         },
         {
             Header: 'fname',
-            accessor: 'fname',
+            accessor: "",
         },
         {
killedBy: StudentsTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  CHRIS FAKE
Received:

[Killed] ObjectLiteral
main/components/Students/StudentsTable.js:20:9
             Header: 'fname',
             accessor: 'fname',
         },
-        {
-           Header: 'lname',
-           accessor: 'lname',
-       },
+        {},
        {
            Header: 'studentId',
killedBy: CoursesShowPage tests renders course correctly for admin
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Students/StudentsTable.js:28:8
            Header: 'studentId',
            accessor: 'studentId',
        },
-       {
-           Header: 'email',
-           accessor: 'email',
-       },
+       {},
        {
            Header: 'githubId',
killedBy: StudentsTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Students/StudentsTable.js:30:22
        },
        {
            Header: 'email',
-           accessor: 'email',
+           accessor: "",
        },
        {
killedBy: StudentsTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  cgaucho@umail.ucsb.edu
Received:

[Killed] StringLiteral
main/components/Students/StudentsTable.js:37:20
            accessor: 'githubId',
        },
        {
-           Header: 'user',
+           Header: "",
            accessor: 'user',
        },
killedBy: StudentsTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: user. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div>
      Total Students: 
      3
    </div>

[Killed] StringLiteral
main/components/Students/StudentsTable.js:38:22
        },
        {
            Header: 'user',
-           accessor: 'user',
+           accessor: "",
        },
   
killedBy: StudentsTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  mama mia
Received:

[Killed] StringLiteral
main/components/Students/StudentsTable.js:46:63
      return (
         <>
             <div>Total Students: {students.length}</div>
-          <OurTable data={students} columns={columns} testid={"StudentsTable"} />
+          <OurTable data={students} columns={columns} testid={""} />
         </>
       );
killedBy: StudentsTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="StudentsTable-cell-row-0-col-id"]

<body>
  <div>
    <div>
      Total Students: 
      3
    </div>
