[Killed] EqualityOperator
src/main/pages/CoursesShowPage.js:45:8
         );
     //this ensures the table row doesn't show up when there's no backend
     let passIn;
-    if(courses.length !== 0){
+    if(courses.length === 0){
         passIn = [courses]
     }else{
killedBy: CoursesShowPage tests renders course correctly for admin
statusReason: TypeError: data.forEach is not a function

[Killed] ConditionalExpression
src/main/pages/CoursesShowPage.js:45:8
         );
     //this ensures the table row doesn't show up when there's no backend
     let passIn;
-    if(courses.length !== 0){
+    if(false){
         passIn = [courses]
     }else{
killedBy: CoursesShowPage tests renders course correctly for admin
statusReason: TypeError: data.forEach is not a function

[Killed] BlockStatement
src/main/pages/CoursesShowPage.js:47:10
     let passIn;
     if(courses.length !== 0){
         passIn = [courses]
-    }else{
-        passIn = courses;
-    }
+    }else{}
     /*I couldn't get useBackendMutation to work, so this is a hodgepodge of work from this stack overflow url:
     * https://stackoverflow.com/questions/71035309/file-upload-using-axios-in-react
killedBy: CoursesShowPage tests renders course correctly for admin
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/main/pages/CoursesShowPage.js:53:38
     /*I couldn't get useBackendMutation to work, so this is a hodgepodge of work from this stack overflow url:
     * https://stackoverflow.com/questions/71035309/file-upload-using-axios-in-react
     * and useBackend.js*/
-    const onSubmit = async (data) => {
-        const formData = new FormData();
-        formData.append("file", data.upload[0]);
-        try {
-            await axios.post("/api/students/upload/egrades", formData, {
-                headers: {
-                    'Content-Type': 'multipart/form-data'
-                },
-                params:{
-                    courseId: id
-                }
-            });
-            toast("Student roster successfully uploaded.");
-        }catch(e){
-            if (e.response.data?.message) {
-                toast(e.response.data.message);
-            } else {
-                const errorMessage = `Error communicating with backend on /api/students/upload/egrades`;
-                toast(errorMessage);
-            }
-        }
-    }
+    const onSubmit = async (data) => {}
 
 
killedBy: CoursesShowPage tests Successfully makes a call to the backend on submit
statusReason: TypeError: Cannot read properties of undefined (reading 'params')

<html>
  <head />
  <body>
    <div>
      <div
        class="d-flex flex-column min-vh-100"

[Killed] BlockStatement
src/main/pages/CoursesShowPage.js:56:13
     const onSubmit = async (data) => {
         const formData = new FormData();
         formData.append("file", data.upload[0]);
-        try {
-            await axios.post("/api/students/upload/egrades", formData, {
-                headers: {
-                    'Content-Type': 'multipart/form-data'
-                },
-                params:{
-                    courseId: id
-                }
-            });
-            toast("Student roster successfully uploaded.");
-        }catch(e){
+        try {}catch(e){
             if (e.response.data?.message) {
                 toast(e.response.data.message);
killedBy: CoursesShowPage tests Successfully makes a call to the backend on submit
statusReason: TypeError: Cannot read properties of undefined (reading 'params')

<html>
  <head />
  <body>
    <div>
      <div
        class="d-flex flex-column min-vh-100"

[Killed] StringLiteral
src/main/pages/CoursesShowPage.js:59:37
         try {
             await axios.post("/api/students/upload/egrades", formData, {
                 headers: {
-                    'Content-Type': 'multipart/form-data'
+                    'Content-Type': ""
                 },
                 params:{
killedBy: CoursesShowPage tests Successfully makes a call to the backend on submit
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "Accept": "application/json, text/plain, */*",
-   "Content-Type": "multipart/form-data",

[Killed] ObjectLiteral
src/main/pages/CoursesShowPage.js:61:24
                 headers: {
                     'Content-Type': 'multipart/form-data'
                 },
-                params:{
-                    courseId: id
-                }
+                params:{}
             });
             toast("Student roster successfully uploaded.");
killedBy: CoursesShowPage tests Successfully makes a call to the backend on submit
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "courseId": 17,
- }

[Killed] StringLiteral
src/main/pages/CoursesShowPage.js:65:19
                     courseId: id
                 }
             });
-            toast("Student roster successfully uploaded.");
+            toast("");
         }catch(e){
             if (e.response.data?.message) {
killedBy: CoursesShowPage tests Successfully makes a call to the backend on submit
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Student roster successfully uploaded."
Received: ""

Number of calls: 1

[Killed] BlockStatement
src/main/pages/CoursesShowPage.js:66:18
                 }
             });
             toast("Student roster successfully uploaded.");
-        }catch(e){
-            if (e.response.data?.message) {
-                toast(e.response.data.message);
-            } else {
-                const errorMessage = `Error communicating with backend on /api/students/upload/egrades`;
-                toast(errorMessage);
-            }
-        }
+        }catch(e){}
     }
 
killedBy: CoursesShowPage tests No crash on timeout
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Error communicating with backend on /api/students/upload/egrades"

Number of calls: 0

<html>
  <head />

[Killed] ConditionalExpression
src/main/pages/CoursesShowPage.js:67:17
             });
             toast("Student roster successfully uploaded.");
         }catch(e){
-            if (e.response.data?.message) {
+            if (true) {
                 toast(e.response.data.message);
             } else {
killedBy: CoursesShowPage tests No crash on timeout
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
src/main/pages/CoursesShowPage.js:67:17
             });
             toast("Student roster successfully uploaded.");
         }catch(e){
-            if (e.response.data?.message) {
+            if (false) {
                 toast(e.response.data.message);
             } else {
killedBy: CoursesShowPage tests Correctly Transmit backend reject
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "File Rejected"
Received: "Error communicating with backend on /api/students/upload/egrades"

Number of calls: 1

<html>

[Killed] BlockStatement
src/main/pages/CoursesShowPage.js:69:20
         }catch(e){
             if (e.response.data?.message) {
                 toast(e.response.data.message);
-            } else {
-                const errorMessage = `Error communicating with backend on /api/students/upload/egrades`;
-                toast(errorMessage);
-            }
+            } else {}
         }
     }
killedBy: CoursesShowPage tests No crash on timeout
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Error communicating with backend on /api/students/upload/egrades"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
src/main/pages/CoursesShowPage.js:70:38
             if (e.response.data?.message) {
                 toast(e.response.data.message);
             } else {
-                const errorMessage = `Error communicating with backend on /api/students/upload/egrades`;
+                const errorMessage = ``;
                 toast(errorMessage);
             }
killedBy: CoursesShowPage tests No crash on timeout
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Error communicating with backend on /api/students/upload/egrades"
Received: ""

Number of calls: 1

<html>
