[Killed] LogicalOperator
main/components/School/SchoolForm.js:105:30
                             {...register("termError", { required: true})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.termError && 'Term Error is required.'}
+                            {errors.termError || 'Term Error is required.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: SchoolForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.
