[Killed] ObjectLiteral
main/components/School/SchoolForm.js:39:48
                         id="abbrev"
                         type="text"
                         isInvalid={Boolean(errors.abbrev)}
-                        {...register("abbrev", {required: true, pattern: abbrev_regex})}
+                        {...register("abbrev", {})}
                         disabled={Boolean(initialContents)}
                         />
killedBy: SchoolForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Abbreviation must be lowercase letters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/School/SchoolForm.js:45:30
                         </OverlayTrigger>
                         <Form.Control.Feedback type="invalid">
                             {errors.abbrev?.type === 'required' && 'Abbreviation is required. '}
-                            {errors.abbrev?.type === 'pattern' && 'Abbreviation must be lowercase letters (_ and . allowed), e.g. ucsb'}
+                            {true && 'Abbreviation must be lowercase letters (_ and . allowed), e.g. ucsb'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: SchoolForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Abbreviation/

Here are the matching elements:

<label
  class="form-label"
  for="abbrev"
>
