[Killed] BlockStatement
main/components/School/SchoolTable.js:15:37
 
      const navigate = useNavigate();
 
-     const editCallback = (cell) => {
-         navigate(`/schools/edit/${cell.row.values.abbrev}`);
-     };
+     const editCallback = (cell) => {};
 
      // Stryker disable all : hard to test for query caching
killedBy: SchoolTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/schools/edit/ucsb"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/School/SchoolTable.js:33:22
 
      const columns = [
          {
-             Header: 'Abbrev',
+             Header: "",
              accessor: 'abbrev',
          },
killedBy: SchoolTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Abbrev. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max

[Killed] ObjectLiteral
main/components/School/SchoolTable.js:44:10
              Header: 'TermRegex',
              accessor: 'termRegex',
          },
-         {
-             Header: 'TermDescription',
-             accessor: 'termDescription',
-         },
+         {},
      ];
 
killedBy: SchoolIndexPage tests Renders with Create Button for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/School/SchoolTable.js:50:46
          },
      ];
 
-     if (hasRole(currentUser, "ROLE_ADMIN")) {
-         columns.push(ButtonColumn("Edit", "primary", editCallback, "SchoolTable"));
-         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "SchoolTable"));
-     }
+     if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
      return <OurTable
killedBy: SchoolTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchoolTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] StringLiteral
main/components/School/SchoolTable.js:58:18
      return <OurTable
          data={school}
          columns={columns}
-         testid={"SchoolTable"} />;
+         testid={""} />;
     };
killedBy: SchoolIndexPage tests renders three schools correctly for admin
statusReason: Error: Unable to find an element by: [data-testid="SchoolTable-cell-row-0-col-abbrev"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
