[Killed] BooleanLiteral
src/main/pages/SchoolCreatePage.js:7:53
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function SchoolCreatePage({storybook=false}) {
+export default function SchoolCreatePage({storybook=true}) {
 
 
killedBy: SchoolCreatePage tests on submit, makes request to backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/schools"}

Number of calls: 0

[Killed] ArrowFunction
src/main/pages/SchoolCreatePage.js:10:33
 export default function SchoolCreatePage({storybook=false}) {
 
 
-    const objectToAxiosParams = (school) => ({
-        url: "/api/schools/post",
-        method: "POST",
-        data: {
-        abbrev: school.abbrev,
-        name: school.name,
-        termRegex: school.termRegex,
-        termDescription: school.termDescription,
-        termError: ""
-        }
-    });
+    const objectToAxiosParams = () => undefined;
 
     const onSuccess = (school) => {
killedBy: SchoolCreatePage tests on submit, makes request to backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
src/main/pages/SchoolCreatePage.js:10:46
 export default function SchoolCreatePage({storybook=false}) {
 
 
-    const objectToAxiosParams = (school) => ({
-        url: "/api/schools/post",
-        method: "POST",
-        data: {
-        abbrev: school.abbrev,
-        name: school.name,
-        termRegex: school.termRegex,
-        termDescription: school.termDescription,
-        termError: ""
-        }
-    });
+    const objectToAxiosParams = (school) => ({});
 
     const onSuccess = (school) => {
killedBy: SchoolCreatePage tests on submit, makes request to backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
src/main/pages/SchoolCreatePage.js:11:14
 
 
     const objectToAxiosParams = (school) => ({
-        url: "/api/schools/post",
+        url: "",
         method: "POST",
         data: {
killedBy: SchoolCreatePage tests on submit, makes request to backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New school created - id: ucsb"

Number of calls: 0

[Killed] StringLiteral
src/main/pages/SchoolCreatePage.js:12:17
 
     const objectToAxiosParams = (school) => ({
         url: "/api/schools/post",
-        method: "POST",
+        method: "",
         data: {
         abbrev: school.abbrev,
killedBy: SchoolCreatePage tests on submit, makes request to backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/SchoolCreatePage.js:22:35
         }
     });
 
-    const onSuccess = (school) => {
-        toast(`New school created - id: ${school.abbrev}`);
-    }
+    const onSuccess = (school) => {}
 
     const mutation = useBackendMutation(
killedBy: SchoolCreatePage tests on submit, makes request to backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New school created - id: ucsb"

Number of calls: 0

[Killed] StringLiteral
src/main/pages/SchoolCreatePage.js:23:15
     });
 
     const onSuccess = (school) => {
-        toast(`New school created - id: ${school.abbrev}`);
+        toast(``);
     }
 
killedBy: SchoolCreatePage tests on submit, makes request to backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New school created - id: ucsb"
Received: ""

Number of calls: 1
