[Killed] BooleanLiteral
src/main/pages/SchoolEditPage.js:8:51
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function SchoolEditPage({storybook=false}) {
+export default function SchoolEditPage({storybook=true}) {
   let { abbrev } = useParams();
 
killedBy: SchoolEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/schools"}

Number of calls: 0

[Killed] ObjectLiteral
src/main/pages/SchoolEditPage.js:15:7
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       [`/api/schools?abbrev=${abbrev}`],
-      {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-        method: "GET",
-        url: `/api/schools`,
-        params: {
-          abbrev // using abbrev param as key 
-        }
-      }
+      {}
     );
 
killedBy: SchoolEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="SchoolForm-abbrev"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
src/main/pages/SchoolEditPage.js:18:17
       {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
         method: "GET",
         url: `/api/schools`,
-        params: {
-          abbrev // using abbrev param as key 
-        }
+        params: {}
       }
     );
killedBy: SchoolEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="SchoolForm-abbrev"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
src/main/pages/SchoolEditPage.js:25:36
     );
 
 
-    const objectToAxiosPutParams = (school) => ({
-      url: "/api/schools/update",
-      method: "PUT",
-      params: {
-        abbrev: school.abbrev,
-      },
-      data: {
-        name: school.name,
-        termRegex: school.termRegex,
-        termDescription: school.termDescription,
-        termError: school.termError
-      }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (school) => {
killedBy: SchoolEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
src/main/pages/SchoolEditPage.js:26:12
 
 
     const objectToAxiosPutParams = (school) => ({
-      url: "/api/schools/update",
+      url: "",
       method: "PUT",
       params: {
killedBy: SchoolEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/SchoolEditPage.js:56:32
     mutation.mutate(data);
   }
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/schools" />
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: SchoolEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/schools"}

Number of calls: 0

[Killed] ConditionalExpression
src/main/pages/SchoolEditPage.js:65:11
       <div className="pt-2">
         <h1>Edit School</h1>
         {
-          school && <SchoolForm initialContents={school} submitAction={onSubmit} buttonLabel="Update" />
+          true
         }
       </div>
killedBy: SchoolEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="SchoolForm-abbrev"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
src/main/pages/SchoolEditPage.js:65:11
       <div className="pt-2">
         <h1>Edit School</h1>
         {
-          school && <SchoolForm initialContents={school} submitAction={onSubmit} buttonLabel="Update" />
+          false
         }
       </div>
killedBy: SchoolEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="SchoolForm-abbrev"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
