[Killed] BlockStatement
src/main/pages/SchoolIndexPage.js:13:32
 
     const { data: currentUser } = useCurrentUser();
   
-    const createButton = () => {  
-      
-        return (
-            <Button
-                variant="primary"
-                href="/schools/create"
-                style={{ float: "right" }}
-            >
-                Create School 
-            </Button>
-        )
-      
-    }
+    const createButton = () => {}
     
     const { data: school, error: _error, status: _status } =
killedBy: SchoolIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create School/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
src/main/pages/SchoolIndexPage.js:19:33
             <Button
                 variant="primary"
                 href="/schools/create"
-                style={{ float: "right" }}
+                style={{ float: "" }}
             >
                 Create School 
killedBy: SchoolIndexPage tests Renders with Create Button for admin user
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null

[Killed] ObjectLiteral
src/main/pages/SchoolIndexPage.js:19:24
             <Button
                 variant="primary"
                 href="/schools/create"
-                style={{ float: "right" }}
+                style={{}}
             >
                 Create School 
killedBy: SchoolIndexPage tests Renders with Create Button for admin user
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null

[Killed] ArrayDeclaration
src/main/pages/SchoolIndexPage.js:33:9
         ["/api/schools/all"],
         // Stryker disable next-line all : GET is the default
         { method: "GET", url: "/api/schools/all" },
-        []
+        ["Stryker was here"]
       );
   
killedBy: SchoolIndexPage tests renders empty table when backend unavailable, admin
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="SchoolTable-cell-row-0-col-abbrev" role="cell" /> instead
