[Killed] BlockStatement
main/components/Courses/CoursesForm.js:10:21
 import SchoolDropdown from "./SchoolDropdown";
 
 function CoursesForm({ initialContents, submitAction, buttonLabel = "Create" }) {
-    useEffect(() => {
-        enableEndDateValidation(); // Call the function to enable end date validation
-    },); // Run only once after component mounts
+    useEffect(() => {},); // Run only once after component mounts
     // Stryker disable all
     const formState = useForm({defaultValues:initialContents || {},})
killedBy: CoursesForm tests calls enableEndDateValidation on mount
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:147:34
                                 {...register("githubOrg", { required: true })}
                             />
                             <Form.Control.Feedback type="invalid">
-                                {errors.githubOrg && 'GithubOrg is required. '}
+                                {false}
                             </Form.Control.Feedback>
                         </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /GithubOrg is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
