[Killed] BooleanLiteral
main/components/Courses/CoursesTable.js:8:100
  import { useNavigate } from "react-router-dom";
  import { hasRole } from "main/utils/currentUser";
 
- export default function CoursesTable({ courses, currentUser, showEnabled = false, deleteEnabled = false }) {
+ export default function CoursesTable({ courses, currentUser, showEnabled = false, deleteEnabled = true }) {
 
      const navigate = useNavigate();
killedBy: UserTable tests No show and delete button when disabled
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-danger" data-testid="CoursesTable-cell-row-0-col-Delete-button" type="button">Delete</button> instead

[Killed] BooleanLiteral
main/components/Courses/CoursesTable.js:8:77
  import { useNavigate } from "react-router-dom";
  import { hasRole } from "main/utils/currentUser";
 
- export default function CoursesTable({ courses, currentUser, showEnabled = false, deleteEnabled = false }) {
+ export default function CoursesTable({ courses, currentUser, showEnabled = true, deleteEnabled = false }) {
 
      const navigate = useNavigate();
killedBy: UserTable tests No show and delete button when disabled
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-primary" data-testid="CoursesTable-cell-row-0-col-Show-button" type="button">Show</button> instead

[Killed] BlockStatement
main/components/Courses/CoursesTable.js:24:37
          navigate(`/courses/edit/${cell.row.values.id}`);
      };
 
-     const showCallback = (cell) => {
-         navigate(`/courses/${cell.row.values.id}`)
-     }
+     const showCallback = (cell) => {}
 
      // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Show button takes the callback
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/courses/1"

Number of calls: 0

<html>
  <head />

[Survived] ArrowFunction
main/components/Courses/CoursesTable.js:51:24
          },
          {
              Header: 'School',
-             accessor: d=> d.school.name,
+             accessor: () => undefined,
          },
          {

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:58:22
              accessor: 'term',
          },
          {
-             Header: 'StartDate',
+             Header: "",
              accessor: 'startDate',
          },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: StartDate. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div>
      Total Courses: 
      3
    </div>

[Killed] BlockStatement
main/components/Courses/CoursesTable.js:73:89
   
      ];
 
-     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-         if(showEnabled){
-             //No infinite linking loops --shouldn't be able to click the show button on the show page
-             columns.push(ButtonColumn("Show", "primary", showCallback, "CoursesTable"));
-         }
-         columns.push(ButtonColumn("Staff", "primary", staffCallback, "CoursesTable"));
-         columns.push(ButtonColumn("Edit", "primary", editCallback, "CoursesTable"));
-         if(deleteEnabled) {
-             columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CoursesTable"));
-         }
-     }
+     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {}
      
      columns.push(ButtonColumn("Join", "primary", joinCallback, "CoursesTable"));
killedBy: CoursesIndexPage tests what happens when you click delete, admin
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.js:74:13
      ];
 
      if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-         if(showEnabled){
+         if(true){
              //No infinite linking loops --shouldn't be able to click the show button on the show page
              columns.push(ButtonColumn("Show", "primary", showCallback, "CoursesTable"));
killedBy: UserTable tests No show and delete button when disabled
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-primary" data-testid="CoursesTable-cell-row-0-col-Show-button" type="button">Show</button> instead

[Killed] BlockStatement
main/components/Courses/CoursesTable.js:74:25
      ];
 
      if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-         if(showEnabled){
-             //No infinite linking loops --shouldn't be able to click the show button on the show page
-             columns.push(ButtonColumn("Show", "primary", showCallback, "CoursesTable"));
-         }
+         if(showEnabled){}
          columns.push(ButtonColumn("Staff", "primary", staffCallback, "CoursesTable"));
          columns.push(ButtonColumn("Edit", "primary", editCallback, "CoursesTable"));
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-Show-button"]

<body>
  <div>
    <div>
      Total Courses: 
      3
    </div>

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:76:40
      if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
          if(showEnabled){
              //No infinite linking loops --shouldn't be able to click the show button on the show page
-             columns.push(ButtonColumn("Show", "primary", showCallback, "CoursesTable"));
+             columns.push(ButtonColumn("", "primary", showCallback, "CoursesTable"));
          }
          columns.push(ButtonColumn("Staff", "primary", staffCallback, "CoursesTable"));
killedBy: UserTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.js:80:13
          }
          columns.push(ButtonColumn("Staff", "primary", staffCallback, "CoursesTable"));
          columns.push(ButtonColumn("Edit", "primary", editCallback, "CoursesTable"));
-         if(deleteEnabled) {
+         if(true) {
              columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CoursesTable"));
          }
killedBy: UserTable tests No show and delete button when disabled
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-danger" data-testid="CoursesTable-cell-row-0-col-Delete-button" type="button">Delete</button> instead

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.js:80:13
          }
          columns.push(ButtonColumn("Staff", "primary", staffCallback, "CoursesTable"));
          columns.push(ButtonColumn("Edit", "primary", editCallback, "CoursesTable"));
-         if(deleteEnabled) {
+         if(false) {
              columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CoursesTable"));
          }
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <div>
      Total Courses: 
      3
    </div>

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:81:50
          columns.push(ButtonColumn("Staff", "primary", staffCallback, "CoursesTable"));
          columns.push(ButtonColumn("Edit", "primary", editCallback, "CoursesTable"));
          if(deleteEnabled) {
-             columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CoursesTable"));
+             columns.push(ButtonColumn("Delete", "", deleteCallback, "CoursesTable"));
          }
      }
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:85:40
          }
      }
      
-     columns.push(ButtonColumn("Join", "primary", joinCallback, "CoursesTable"));
+     columns.push(ButtonColumn("Join", "", joinCallback, "CoursesTable"));
 
 
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn
