[Killed] ArrowFunction
src/main/pages/CoursesEditPage.js:25:34
     );
 
 
-  const objectToAxiosPutParams = (course) => ({
-    url: "/api/courses/update",
-    method: "PUT",
-    params: {
-      id: course.id,
-      name: course.name,
-      schoolAbbrev: course.schoolAbbrev,
-      term: course.term,
-      startDate: course.startDate,
-      endDate: course.endDate,
-      githubOrg: course.githubOrg
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (course) => {
killedBy: CoursesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
src/main/pages/CoursesEditPage.js:28:13
   const objectToAxiosPutParams = (course) => ({
     url: "/api/courses/update",
     method: "PUT",
-    params: {
-      id: course.id,
-      name: course.name,
-      schoolAbbrev: course.schoolAbbrev,
-      term: course.term,
-      startDate: course.startDate,
-      endDate: course.endDate,
-      githubOrg: course.githubOrg
-    },
+    params: {},
   });
 
killedBy: CoursesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 9
+ Received  + 1

- Object {
-   "endDate": "2023-03-12T00:00",
-   "githubOrg": "ucsb-cs156-w23",
