[Killed] ArrayDeclaration
main/components/Courses/SchoolDropdown.js:5:36
 import { Form } from "react-bootstrap";
 import {useFormContext} from "react-hook-form";
 
-const SchoolDropdown = ({schools = [], testId}) => {
+const SchoolDropdown = ({schools = ["Stryker was here"], testId}) => {
     const {
         register,
killedBy: Tests as a standalone school dropdown Works without schools passed in
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <option data-testid="SchoolDropdownExample-option-0" /> instead

[Killed] BooleanLiteral
main/components/Courses/SchoolDropdown.js:15:51
         <Form.Label htmlFor="school">School</Form.Label>
         <Form.Control data-testid={`${testId}-school`} id="school"  as="select"
           isInvalid={Boolean(errors.school)}
-          {...register("schoolAbbrev", {required: true, minLength: 2})}
+          {...register("schoolAbbrev", {required: false, minLength: 2})}
         >
             <option value=""></option>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /School is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BlockStatement
main/components/Courses/SchoolDropdown.js:18:47
           {...register("schoolAbbrev", {required: true, minLength: 2})}
         >
             <option value=""></option>
-            {schools.map(function (object, i) {
-                const key = `${testId}-option-${i}`
-                return(
-                    <option key={key} data-testid={key} value={object.abbrev}>
-                        {object.name}
-                    </option>
-                );
-            })}
+            {schools.map(function (object, i) {})}
         </Form.Control>
         <Form.Control.Feedback type="invalid">
killedBy: Tests as a standalone school dropdown Renders 3 schools correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchoolDropdownExample-option-0"]

<body>
  <div>
    <form
      class=""
    >
      <div>

[Killed] StringLiteral
main/components/Courses/SchoolDropdown.js:19:29
         >
             <option value=""></option>
             {schools.map(function (object, i) {
-                const key = `${testId}-option-${i}`
+                const key = ``
                 return(
                     <option key={key} data-testid={key} value={object.abbrev}>
killedBy: Tests as a standalone school dropdown Renders 3 schools correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchoolDropdownExample-option-0"]

<body>
  <div>
    <form
      class=""
    >
      <div>

[Killed] LogicalOperator
main/components/Courses/SchoolDropdown.js:28:14
             })}
         </Form.Control>
         <Form.Control.Feedback type="invalid">
-            {errors.schoolAbbrev && 'School is required. '}
+            {errors.schoolAbbrev || 'School is required. '}
         </Form.Control.Feedback>
     </Form.Group>);
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/Courses/SchoolDropdown.js:28:14
             })}
         </Form.Control>
         <Form.Control.Feedback type="invalid">
-            {errors.schoolAbbrev && 'School is required. '}
+            {false}
         </Form.Control.Feedback>
     </Form.Group>);
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /School is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
