[Killed] BooleanLiteral
main/components/Students/StudentsForm.js:22:58
                                   type="file"
                                   accept=".csv"
                                   isInvalid={Boolean(errors.upload)}
-                        {...register("upload", {required:true})} />
+                        {...register("upload", {required:false})} />
                     <Form.Control.Feedback type="invalid">
                         {errors.upload && 'Roster is required. '}
killedBy: StudentsForm Tests Required fires when there's no input
statusReason: TypeError: e is not a function

[Killed] ObjectLiteral
main/components/Students/StudentsForm.js:22:48
                                   type="file"
                                   accept=".csv"
                                   isInvalid={Boolean(errors.upload)}
-                        {...register("upload", {required:true})} />
+                        {...register("upload", {})} />
                     <Form.Control.Feedback type="invalid">
                         {errors.upload && 'Roster is required. '}
killedBy: StudentsForm Tests Required fires when there's no input
statusReason: TypeError: e is not a function

[Killed] ConditionalExpression
main/components/Students/StudentsForm.js:24:26
                                   isInvalid={Boolean(errors.upload)}
                         {...register("upload", {required:true})} />
                     <Form.Control.Feedback type="invalid">
-                        {errors.upload && 'Roster is required. '}
+                        {false}
                     </Form.Control.Feedback>
                 </Form.Group>
killedBy: StudentsForm Tests Required fires when there's no input
statusReason: Error: Unable to find an element with the text: /Roster is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Students/StudentsForm.js:24:26
                                   isInvalid={Boolean(errors.upload)}
                         {...register("upload", {required:true})} />
                     <Form.Control.Feedback type="invalid">
-                        {errors.upload && 'Roster is required. '}
+                        {errors.upload || 'Roster is required. '}
                     </Form.Control.Feedback>
                 </Form.Group>
killedBy: StudentsForm Tests Required fires when there's no input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.
